package core;

public class Story {        //这个类用于存放故事内容

    public static String backGround="在探险者中流传着这样一个传说\n" +
            "\n" +
            "“森林的尽头住着邪恶的魔女\n" +
            "  她的住所藏着无数的宝石和金币\n" +
            "  她的城堡缠绕着黑色的荆棘\n" +
            "  当她走出森林时，王国将会迎来深重的灾难\n" +
            "  她操纵着巨大的怪物，所到之处陷入火海\n" +
            "  她会带走所有的珍贵之物，破坏眼前的一切”\n" +
            "\n" +
            "人们恐惧着魔女，又觊觎着她的宝藏\n" +
            "无数的探险者前往森林讨伐魔女，却都无功而返\n" +
            "而现在，得知这个传说的你，正站在森林的入口……";

    public static String story1="    “从这里开始就是最危险的地方。”\n" +
            "    我拿着地图确认方位。根据整理的情报，绝大多数的探险者都被拦在了这里。\n" +
            "    一眼看去，森林一望无际，在参天的树木中只有一条弯曲的小路，不知通向何方。\n" +
            "    “难道说是迷宫？这就能解释为什么那么多人在这里迷路了，倒也很符合魔女的设定。”\n" +
            "    我试着向前跨出一步，鞋子陷进柔软的草地中，留下一个浅浅的凹痕。\n" +
            "    “看来真的是很久没人来过了……草都长得这么长。不过也好，留下足迹的话也方便原路返回。”\n" +
            "    在进入森林前，我回头看了一眼王国的方向。王城的尖塔高耸入云，即使这里已经是王国的边缘，也能看见塔顶琉璃反射的阳光。\n" +
            "    “威胁王国的魔女……”\n" +
            "    我暂时压下心中的疑惑，向森林深处走去。";

    public static String story2="    总算是遇到了一片较为开阔的草地。我放下武器和背包稍作休息。\n" +
            "    有关我心中的疑惑……事实上，我此次前来的目的，主要是验证“那个传说”的真实性。\n" +
            "    换句话说，我怀疑魔女并不存在。\n" +
            "    在来到这个王国之前，我对它的历史做过很多调查。这个国家相当富饶，并且曾多次陷入战火。如今的财富虽不如以前，但也远胜于周边国家。\n" +
            "    “财富被魔女掠夺，战争也是由魔女引起……这样想，传说就合理多了。但如果反过来，是人们将战争误传为是魔女带来的灾难的话……”\n" +
            "    还有一点我很在意……这个王国最开始，是靠不断攻打周边国家、掠夺财富而发展起来的。那时的国王相当暴戾……\n" +
            "    我自言自语着整理思绪，余光瞥见了有什么在阳光下闪闪发光。\n" +
            "    “诶，宝箱？”";

    public static String story3="    “真是难以置信……”\n" +
            "    宝箱里装着其他探险者留下的手记。整理了记录的内容后，得出的结论使我大吃一惊。\n" +
            "    “原来魔女真的存在。不仅如此，她还曾经是这个国家的大祭司。”\n" +
            "    当年王国征战期间，正是借助了大祭司的魔法才能战无不胜。但随着财富的积累，国王也越加贪婪和残忍。\n" +
            "    对此心生不满的大祭司想离开国家，却遭到国王的阻挠和威胁。她在愤怒之下，带走了国库里一半的财宝，逃往了森林深处。\n" +
            "    国王为了夺回财宝，向国民宣称大祭司是邪恶的魔女，征集勇士前去讨伐，而魔女藏着财宝的消息也引起了寻宝者们的注意。那个传说就是这样成型的。\n" +
            "    “这应该是距今几十年前的事了，传说有所添油加醋也很正常。如果手记内容属实……那么，虽然魔女并不像传说中那么邪恶，但她的宝藏是真实存在的？”\n" +
            "    正当我发出感慨时，树林中传来了响声。几只巨大的紫色蝙蝠正透过树叶紧盯着我。\n" +
            "    “看来，魔女会操控怪物也是真的啊。那么，为了亲眼见证魔女的宝藏……必须打赢这些怪物才能继续前进了。”";

    public static String story4="    越往前走，怪物就越多。好消息是，已经可以看见魔女的城堡了。\n" +
            "    只要到达城堡就能揭开真相。眼看目标将要达成，我也不由得紧张起来。\n" +
            "    如果与魔女发生冲突……我可没信心能战胜魔法。不过事到如今，说放弃也太迟了。\n" +
            "    我深吸一口气，毫不犹豫地迈出脚步。";

    public static String end= "    眼前矗立着阴森的黑色城堡。城堡的门被荆棘覆盖着，和传说中描写的一样。我用剑砍断荆棘，推开城堡的门。\n" +
            "    大厅的中央静静地沉睡着一具骷髅。现在我才意识到，根本不必担心会被魔女攻击，因为魔女已经死了。\n" +
            "    我也不用花时间寻找宝藏，因为它们就在骷髅的身后。宝石和金币都覆盖着灰尘，随意堆放在城堡的角落中。\n" +
            "    看来魔女并非在意这些财宝。她只是在惩罚国王的贪婪罢了。\n" +
            "\n" +
            "    验证了传说，我此行的目的也达到了。\n" +
            "    临走前，我效仿前人将记录放进宝箱，等待下一位探险者的到来。不知道他会得出怎样的结论呢。\n" +
            "    怀着顺利结束探险的满足感，我离开了魔女的森林。\n" +
            "\n" +
            "    ——完——";

    public static String good1="箱子里装着一张纸。\n" +
            "\n" +
            "【通缉】\n" +
            "邪恶的魔女藏在森林中。这是会给王国带来灾难的危险存在，必须立即消灭。\n" +
            "现征集勇士前往森林深处讨伐魔女。成功者将封赏为贵族，世代享受荣华富贵与无上的荣誉。\n" +
            "\n" +
            "魔女的通缉令？看得出国王很急切地想要消灭她。";

    public static String good2="箱子里装着一张纸。\n" +
            "\n" +
            "【大新闻】\n" +
            "国库财宝被盗！犯人是住在森林深处的魔女？\n" +
            "据王城中的侍卫所称，邪恶的魔女一夜之间偷走了国库一半的财宝，国王正大发雷霆！\n" +
            "各位寻宝者们，机会来了！想见识一下国库的珍藏吗？想拥有与贵族匹敌的财富吗？\n" +
            "据悉，魔女将无数的宝石和金币藏在了森林深处。现在就出发去寻找魔女的宝藏吧！\n" +
            "\n" +
            "说得我也有点心动……不对，我现在不正是在寻宝的路上吗？";

    public static String good3="箱子里装着一张纸。\n" +
            "\n" +
            "【警惕】\n" +
            "无辜的旅人，请不要在冬天前来此处。\n" +
            "冰雪覆盖大地时，邪恶的冰霜巨人将会出现。\n" +
            "为了您的安全，请早日返回。\n" +
            "\n" +
            "我倒是很想见识一下冰霜怪物呢。最近会下雪吗？";
}
